# CLI Tools
brew "git"
brew "curl"
brew "wget"
brew "zsh"
brew "fzf"
brew "fd"
brew "bat"
brew "ripgrep"
brew "eza"
brew "git-delta"
brew "tree"
brew "fresh-editor"
brew "neovim"

# GUI Apps
cask "dropbox"
cask "wezterm"
cask "visual-studio-code"
cask "zed"
cask "firefox"
cask "google-chrome"
cask "brave-browser"
cask "obsidian"
cask "typora"
